import CategoriesSection from "./CategoriesSection";
import Header from "./Header";
import PriceSection from "./PriceSection";
import ProductSection from "./ProductSection";
import WhatWeCanDo from "./WhatWeCanDo";

export default function HomePage() {
  return (
    <div>
      <Header />
      <CategoriesSection />
      <div className="md:flex items-center md:px-[8%] md:bg-cl1 text-white py-14">
        <div className="md:hidden block image-container md:h-[400px] h-[270px] flex-1"></div>
        <div className="flex-1 md:p-0 p-4">
          <p className="text-right">
            قائمتنا مليئة بالكعك الطازج، من الكعك الكلاسيكي إلى الإبداعات
            الفريدة التي تناسب جميع الأذواق. يتم اختيار المكونات بعناية لضمان
            أعلى جودة وطعم لا مثيل له. نحن نهتم بتقديم تشكيلة واسعة لتناسب جميع
            المناسبات، سواء كانت أعياد الميلاد، الأفراح، أو أي مناسبة خاصة.
          </p>
        </div>
        <div className="md:block hidden image-container md:h-[400px] h-[270px] flex-1"></div>
      </div>
      <ProductSection />
      {/* <div className="flex px-[10%] my-10 promotion-container text-white">
        <div className="md:w-[50%] mx-auto py-14">
          <p className="text-right">
            قائمتنا مليئة بالكعك الطازج، من الكعك الكلاسيكي إلى الإبداعات
            الفريدة التي تناسب جميع الأذواق. يتم اختيار المكونات بعناية لضمان
            أعلى جودة وطعم لا مثيل له. نحن نهتم بتقديم تشكيلة واسعة لتناسب جميع
            المناسبات، سواء كانت أعياد الميلاد، الأفراح، أو أي مناسبة خاصة.
          </p>
          <p className="font-bold text-xl text-center">
            زورونا اليوم لاكتشاف عالم الحلويات اللذيذة والكعك الرائعة. نحن هنا
            لتلبية احتياجاتك الحلوة وجعل كل مناسبة خاصة بلمسة فريدة منا.
          </p>
        </div>
      </div> */}
      <PriceSection />
      <WhatWeCanDo />
    </div>
  );
}

/*
------------------------------------------------------------------------------------------------
بناءً على فهمي لطلبك، إليك محتوى يمكن استخدامه لوصف محل حلويات أو مخبز:

مرحبًا بك في متجر الحلويات الخاص بنا!
نحن نفخر بتقديم تشكيلة متنوعة من الحلويات اللذيذة والكعك الطازجة. في محلنا، نهتم بتقديم تجربة فريدة ولذيذة لعملائنا.

قائمتنا مليئة بالكعك الطازج، من الكعك الكلاسيكي إلى الإبداعات الفريدة التي تناسب جميع الأذواق. يتم اختيار المكونات بعناية لضمان أعلى جودة وطعم لا مثيل له. نحن نهتم بتقديم تشكيلة واسعة لتناسب جميع المناسبات، سواء كانت أعياد الميلاد، الأفراح، أو أي مناسبة خاصة.

فريقنا المحترف من الطهاة يعمل بجد لإعداد كل قطعة بعناية فائقة، مع الاهتمام بالتفاصيل الصغيرة. نحن نؤمن بالجودة والذوق الرفيع، ونضمن أن تكون تجربة شراءك في محلنا لا تُنسى.

زورونا اليوم لاكتشاف عالم الحلويات اللذيذة والكعك الرائعة. نحن هنا لتلبية احتياجاتك الحلوة وجعل كل مناسبة خاصة بلمسة فريدة منا.
*/
