
export const navigationLinks = [
  {text:'الرئيسية', path:'/'},
  {text:'حلا', path:'/store'},
  {text:'الخدمات', path:'/'},
  {text:'عن لي ثري', path:'/'},
  {text:'تواصل معنا', path:'/'},
  {text:'لمزيد', path:'/'},
]

export const categories = [
  {name:'جميع', text:'طعم لا يقاوم.تشكيلة واسعة تناسب جميع الأذواق.إمكانية تخصيص الكيك حسب رغبتك.توصيل سريع وموثوق.انضم إلينا اليوم وكن جزءًا من تجربة الكيك الاستثنائية!"', image:process.env.PUBLIC_URL+'/images/cookies-8082386_1280.jpg'},
  {name:'معجنات', text:'طعم لا يقاوم.تشكيلة واسعة تناسب جميع الأذواق.إمكانية تخصيص الكيك حسب رغبتك.توصيل سريع وموثوق.انضم إلينا اليوم وكن جزءًا من تجربة الكيك الاستثنائية!"', image:process.env.PUBLIC_URL+'/images/cookies-8082386_1280.jpg'},
  {name:'حلا', text:'طعم لا يقاوم.تشكيلة واسعة تناسب جميع الأذواق.إمكانية تخصيص الكيك حسب رغبتك.توصيل سريع وموثوق.انضم إلينا اليوم وكن جزءًا من تجربة الكيك الاستثنائية!"', image:process.env.PUBLIC_URL+'/images/cube3.jpeg'},
  {name:'كيك', text:'طعم لا يقاوم.تشكيلة واسعة تناسب جميع الأذواق.إمكانية تخصيص الكيك حسب رغبتك.توصيل سريع وموثوق.انضم إلينا اليوم وكن جزءًا من تجربة الكيك الاستثنائية!"', image:process.env.PUBLIC_URL+'/images/cube3.jpeg'},
  {name:'أسر منتجة', text:'طعم لا يقاوم.تشكيلة واسعة تناسب جميع الأذواق.إمكانية تخصيص الكيك حسب رغبتك.توصيل سريع وموثوق.انضم إلينا اليوم وكن جزءًا من تجربة الكيك الاستثنائية!"', image:process.env.PUBLIC_URL+'/images/green.jpeg'},
  {name:'معجنات', text:'طعم لا يقاوم.تشكيلة واسعة تناسب جميع الأذواق.إمكانية تخصيص الكيك حسب رغبتك.توصيل سريع وموثوق.انضم إلينا اليوم وكن جزءًا من تجربة الكيك الاستثنائية!"', image:process.env.PUBLIC_URL+'/images/cookies-8082386_1280.jpg'},
  {name:'كيك', text:'طعم لا يقاوم.تشكيلة واسعة تناسب جميع الأذواق.إمكانية تخصيص الكيك حسب رغبتك.توصيل سريع وموثوق.انضم إلينا اليوم وكن جزءًا من تجربة الكيك الاستثنائية!"', image:process.env.PUBLIC_URL+'/images/cube3.jpeg'},
]